import Foundation

extension Flower {
  static let flowers: [Flower] = [
    Flower(
      id: "001",
      name: "サクラ",
      description: "桜（サクラ）は、バラ科サクラ属に属する落葉広葉樹で、日本の春を象徴する花として広く知られています。特に、日本の風景や文化に深く根付いており、桜の花見は春の風物詩として定着しています。桜の木は、花の美しさだけでなく、その儚さも魅力の一部とされています。\n\n桜の種類は非常に多く、野生種から改良種まで約600種類以上が存在します。最も有名な種類の一つが「ソメイヨシノ」です。ソメイヨシノは、江戸時代末期に作られた品種で、東京の染井村（現在の豊島区駒込）から広がりました。この品種は成長が早く、大きく育ち、薄いピンク色の花を一斉に咲かせる特徴があります。\n\n桜の開花は、日本全国で気象庁による開花予想が行われるほど注目されています。通常、南の地域から順に開花し、北上していきます。桜前線と呼ばれるこの現象は、毎年多くの人々が心待ちにするイベントです。\n\n桜の花は通常、葉が出る前に咲き、満開になると短い期間で散ってしまいます。この儚い美しさが、多くの人々の心を打つ理由です。桜の花が散る様子は「花吹雪」として知られ、その光景は詩や歌、絵画などで表現されることが多いです。\n\nまた、桜は日本文化において重要な象徴でもあります。古くから詩歌の題材となり、平安時代の「万葉集」や「古今和歌集」にも桜を詠んだ歌が多数収められています。さらに、現代においても桜は卒業式や入学式、入社式など、人生の節目を祝うシンボルとして親しまれています。\n\n桜の花見は、家族や友人と共に桜の木の下で食事や飲み物を楽しむ習慣で、春の訪れを祝う日本の風物詩です。このように、桜は日本人の心に深く根付いた特別な存在です。",
      imageName: "001.jpg",
      season: .spring
    ),
    Flower(
      id: "002",
      name: "スミレ",
      description: "種名としてのスミレ（Viola mandshurica）は、道ばたで春に花を咲かせる野草である。日本の数あるスミレのなかまの代表格としても知られる。深い紫（菫色）の花を咲かせる。\n\n多年草。草丈は10センチメートル (cm) 前後になる。地下茎は太くて短く、多数の葉を根出状に出す。葉は根際から出て直立し、少し長めの葉柄には翼があり、少しやじり形っぽい先の丸い葉をつける。スミレの仲間には、地上に茎が立ち上がるものと、地上茎がなくて葉がすべて根元から出るものがあるが、本種は後者である。\n\n花期は春。葉よりも高く伸び出た花柄の先に、濃い紫色の花が1個咲く。花は蝶形をした独特の形で、ラッパのような形の花を横向きかやや斜め下向きにつける。5枚の花びらは大きさが同じでなく、下側の1枚が大きいので、花の形は左右対称になる。後方の突起物であるラッパの管に当たる部分は、大きい花弁の奥が隆起したもので距（きょ）といい、その中に花蜜を貯めている。花茎は根際から出て、やや立ち上がり、てっぺんで下を向いて花のラッパの管の中程に上側から付く。花には閉鎖花も混じり、虫の助けを借りずに自家受粉して果実をつくる。果実は蒴果で、はじめ下を向いているが熟すと上を向いて3つに裂開して、30 - 50個の褐色の種子が露出する。種子の長さは1.8ミリメートル (mm) ほどの倒卵形で、へそ側が尖り種枕がある。種子の端に、アリが好む脂肪の塊（エライオソーム）をつけていて、種子ごとアリが巣に持ち帰るので生育域を広げることができる。",
      imageName: "002.jpg",
      season: .spring
    ),
    Flower(
      id: "006",
      name: "ヒマワリ",
      description: "原産地は、北アメリカ。高さ3mくらいまで成長し、夏から秋にかなり大きな黄色の花を咲かせる。また、ヒマワリの花の色の濃い部分はやや赤みがかった黄色(黄金っぽい黄色)をしている。\n\n花弁は大きな1つの花のように見えるが、実際は頭状花序と呼ばれ、多数の花が集まって1つの花の形を形成している。これは、キク科の植物に見られる特徴である。外輪に黄色い花びらをつけた花を「舌状花」、内側の花びらがない花を「筒状花」と区別して呼ぶ場合がある。\n\n和名「向日葵」の由来は、太陽の動きにつれてその方向を追うように花が回るといわれたことから。ただしこの動きは生長に伴うものであるため、実際に太陽を追って動くのは生長が盛んな若い時期だけである。若いヒマワリの茎の上部の葉は太陽に正対になるように動き、朝には東を向いていたのが夕方には西を向く。日没後はまもなく起きあがり、夜明け前にはふたたび東に向く。この運動はつぼみを付ける頃まで続くが、つぼみが大きくなり花が開く頃には生長が止まるため動かなくなる。その過程で日中の西への動きがだんだん小さくなるにもかかわらず夜間に東へ戻る動きは変わらないため、完全に開いた花は基本的に東を向いたままほとんど動かない。なお、これは茎頂に一つだけ花をつける品種が遮るもののない日光を受けた場合のことであり、多数の花をつけるものや日光を遮るものがある場所では必ずしもこうはならない。\n\nヒマワリの種は螺旋状に並んでおり、螺旋の数を数えていくとフィボナッチ数が現れる。\n\n種は長卵形でやや平たい。種皮色は油料用品種が黒色であり、食用や観賞用品種には長軸方向に黒と白の縞模様がある。",
      imageName: "006.jpg",
      season: .summer
    ),
    Flower(
      id: "011",
      name: "コスモス",
      description: "一年生植物の草本。茎は高さ2 - 3mになり、よく枝を出す。葉は対生で二回羽状複葉。細かく裂け、小葉はほぼ糸状になる。頭花は径6 - 10cm、周囲の舌状花は白から淡紅色、あるいは濃紅色。中央の筒状花は黄色。葯は黄褐色。通常は舌状花は8個。開花期は秋で、短日植物の代表としても知られる。\n\n秋に桃色・白・赤などの花を咲かせる。花は本来一重咲きだが、舌状花が丸まったものや、八重咲きなどの品種が作り出されている。本来は短日植物だが、6月から咲く早生品種もある。",
      imageName: "011.jpg",
      season: .autumn
    ),
    Flower(
      id: "012",
      name: "ヒガンバナ",
      description: "全草が有毒な多年生の球根を作る植物である。地下にはタマネギのような小ぶりの鱗茎があり、卵状球形で外皮が黒く、下方にやや太くて白いひげ根を有する。\n\n花期は秋の彼岸のころ（9月中旬）で、土中の花芽は温度の変化だけを感じて季節を知り、葉よりも先に地上から花茎を出し、散形花序で真っ赤な6弁の花を放射状（輪状）に数個つけて咲く。その姿は独特で、高さ30 - 60センチメートル (cm) の枝も葉も節も無い花茎が地上に突出し、その先端に苞に包まれた花序が1つだけ付く。苞が破れると5 - 7個前後の花が顔を出す。花は短い柄があって横を向いて開き、全体としては全ての花が輪生状に外向きに並ぶ。花径は5 - 15 cm ほどある。1つの花には、花被片（花弁）が6個つき、長さ40ミリメートル (mm)、幅約5 mmと細長く、大きく反り返る。雄しべは6本、雌しべが1本あり、ともに花外に長く突き出る。ヒガンバナの蕾は5月中頃には鱗茎の中で作られ、葉が無くとも地下の鱗茎に蓄えた栄養分を使って花茎を伸ばし、地上から顔を出してから1週間ほどで花を咲かすことができる。\n\n三倍体の場合は種子ができず、花後に花茎が無くなると（10月ごろ）葉が束になって伸び出す。葉は扁平な線形で濃緑色で光沢があり、中脈と葉の裏側が白っぽい。晩秋には、鱗茎1個から長さ30 - 50 cm の細い葉をロゼット状に数枚出して緑を保ったまま冬を越し、ほかの植物が葉を茂りだす初夏（4 - 6月ごろ）には葉を枯らして地上部は見えなくなる。\n\n日本列島のヒガンバナは種子を作らない、自然の中で生まれた3倍体植物の代表的な種である。ただし、ごくまれに種子ができる場合があるとも言われているが発芽能力は無い。日本列島の3倍体のヒガンバナは種子ができない代わりに、土の中で球根を旺盛に分球して繁殖してきたため、遺伝的には同一遺伝子を有し、同じ地域の個体は開花期や花の大きさや色、草丈がほぼ同じように揃うのは、クローンであるためである。",
      imageName: "012.jpg",
      season: .autumn
    ),
    Flower(
      id: "019",
      name: "ヒガンバナ",
      description: "球根で育つ。種子から育てることもできるが、花が咲く大きさの球根に育つまで数年かかる。\n\n冬の終わりから春先にかけ花を咲かせ、春を告げる花として知られる。\n\n花は白で、3枚ずつの長い外花被と短い内花被を持つ六弁花。いくつかの種では内花被に緑色の斑点がある。\n\n夜になると花を閉じ、昼間吸収した温かい空気を保管する。",
      imageName: "019.jpg",
      season: .winter
    ),
    Flower(
      id: "020",
      name: "フクジュソウ",
      description: "日本ではフクジュソウ（エダウチフクジュソウともいう。Adonis ramosa）、ミチノクフクジュソウ（Adonis multiflora）、キタミフクジュソウ（Adonis amurensis）、シコクフクジュソウ（Adonis shikokuensis）の4種が自生する。キタミフクジュソウの種小名である amurensis は「アムール川流域の」という意味である。\n\nフクジュソウ（エダウチフクジュソウ）は自生地が北海道から九州にかけてであり、茎が中実であることが特徴である。\n\nキタミフクジュソウは自生地が北海道東部に限られ、多毛であり茎が中実で、一株に1輪しか花を付けない点が特徴である。\n\nミチノクフクジュソウは自生地が東北から九州にかけてであり、茎が中空で、萼が花弁の半分程度であることが特徴で、他種の萼と花弁の長さは同等程度なので見分けることができる（したがって、本項テンプレート掲載の写真はミチノクフクジュソウと判断できる）。\n\nシコクフクジュソウは自生地が四国及び九州の一部に限られ、全草無毛であることや、茎が中空であることが特徴である。\n\n花期は早春であり、3-4cmの黄色い花を咲かせる。当初は茎が伸びず、苞に包まれた短い茎の上に花だけがつくが次第に茎や葉が伸び、キタミフクジュソウ以外はいくつかの花を咲かせる。花は花弁を使って日光を花の中心に集め、その熱で虫を誘引している。そのため、太陽光に応じて開閉する（日光が当たると開き、日が陰ると閉じる）。葉は細かく分かれる。夏になると地上部を枯らす。初春に花を咲かせ、夏までに光合成をおこない、それから春までを地下で過ごす。いずれの種も石灰岩質を好む。",
      imageName: "020.jpg",
      season: .winter
    ),
  ]
  
  static let flowerGroup: [String: [Flower]] = Dictionary(grouping: Flower.flowers, by: {$0.season.rawValue})
}
